Repository: common-repository/wp-jcryption
Catalog: languages/wpjc-*.po
Languages: de_de, pt_br, ru_ru, uk_ua

source: Unable to read RSA keys. WP jCryption plugin has been deactivated. %s
de_de: RSA Schlüssel konnten nicht gelesen werden. Das WP jCryption Plugin wurde deaktiviert. %s
pt_br: Chave RSA não pode ser lida. O plugin WP jCryption foi desativado. %s
ru_ru: Не удалось получить RSA-ключи. Плагин WP jCryption деактивирован. %s
uk_ua: Не вдалося прочитати RSA-ключі. Плагін WP jCryption деактивовано. %s

source: Back to admin area
de_de: Zurück zum Admin-Bereich
pt_br: Voltar para a área de administração
ru_ru: Вернуться в админку
uk_ua: Повернутися в адмінку

source: WP jCryption is not working currently because it requires PHP 5.3+ with OpenSSL extension.
de_de: WP jCryption funktioniert momentan nicht, da PHP 5.3+ mit der OpenSSL-Erweiterung benötigt wird.
pt_br: WP jCryption não está functionando pois necessita PHP 5.3+ com a extensão OpenSSL.
ru_ru: WP jCryption сейчас не работает, так как для этого требуется PHP 5.3+ с поддержкой OpenSSL.
uk_ua: WP jCryption зараз не працює, тому що для цього необхідно PHP 5.3+ з підтримкою OpenSSL.

source: Public and private keys have not been generated yet.
de_de: Öffentlicher und privater Schlüssel wurden noch nicht erzeugt.
pt_br: Chaves pública e privada ainda não foram geradas.
ru_ru: Публичный и приватный ключи ещё не созданы.
uk_ua: Публічний і приватний ключи ще не були створені.

source: Secured by WP jCryption
de_de: Gesichert durch WP jCryption
pt_br: Seguro através WP jCryption

source: RSA keys have been created before: %s
de_de: RSA Schlüssel wurden bereits erzeugt: %s
pt_br: Chaves RSA ja foram criadas em: %s
ru_ru: RSA-ключи уже были созданы раньше: %s
uk_ua: RSA-ключі вже було створено раніше: %s

source: Form selectors
de_de: Formularauswahl
pt_br: Seletor de formulários
ru_ru: Селекторы форм
uk_ua: Селектори форм

source: List forms which data are to be encrypted (in jQuery style, separated by commas), e. g.:
de_de: Liste von Eingabefeldern, deren Daten verschlüsselt werden sollen (in jQuery-Stil, durch Kommas getrennt), z. B.:
pt_br: Lista de formulários que contém dados a serem encriptados (em estilo jQuery, separados por vírgulas), por exemplo:
ru_ru: Перечислите формы (в стиле jQuery, через запятую), данные из которых должны шифроватся, например:
uk_ua: Список форм (в стилі jQuery, через кому), дані яких мають бути зашифрованими, наприклад:

source: Also use in admin area (user profile form data will be encrypted anyway)
de_de: Auch im Admin-Bereich benutzen (Eingabefelder für Benutzerdaten werden in jedem Fall verschlüsselt)
pt_br: Também utilizado na área administrativa (dados dos usuários serão encriptados de qualquer forma)
ru_ru: Также использовать в админке (данные формы пользователя будут шифроваться в любом случае)
uk_ua: Також застосовувати в адмінці (дані форми користувача будуть зашифровані завжди)

source: Indicate secured form inputs with color
de_de: Gesicherte Eingabefelder farblich kennzeichnen
pt_br: Marcar formulários seguros com cor
ru_ru: Выделять цветом поля защищенных форм
uk_ua: Виділити кольором поля захищених форм

source: Fix button id=&#34;submit&#34; and name=&#34;submit&#34; by replacing this with &#34;wpjc-submit&#34;
de_de: Korrektur von button id=&#34;submit&#34; und name=&#34;submit&#34 durch Ersetzen mit &#34;wpjc-submit&#34;
pt_br: Correção do butão id=&#34;submit&#34; e name=&#34;submit&#34 através de &#34;wpjc-submit&#34;
ru_ru: Исправлять в кнопках id=&#34;submit&#34; и name=&#34;submit&#34;, заменяя их на &#34;wpjc-submit&#34;
uk_ua: Виправляти в кнопках id=&#34;submit&#34; і name=&#34;submit&#34;, замінюючи їх на &#34;wpjc-submit&#34;

source: Current Key Pair
de_de: Aktuelles Schlüsselpaar
pt_br: Par de chaves atual
ru_ru: Действующая пара ключей
uk_ua: Діюча пара ключей

source: Generation date: %s. Current RSA public key length: %d.
de_de: Erzeugungsdatum: %s. Aktuelle Länge des öffentlichen RSA Schlüssels: %d.
pt_br: Data de geração: %s. Atual tamanho da chave RSA pública: %d.
ru_ru: Время создания: %s. Длина текущего публичного RSA ключа: %d.
uk_ua: Час створення: %s. Довжина діючого публічного RSA ключа: %d.

source: Private key is not shown here but it is stored in the database.
de_de: Der private Schlüssel wird hier nicht angezeigt, ist aber in der Datenbank gespeichert.
pt_br: A chave privada não está sendo exibida, porém está salva no banco de dados.
ru_ru: Приватный ключ не показан, но хранится в базе данных.
uk_ua: Приватний ключ не показано, але він зберігається в базі даних.

source: New key length:
de_de: Neue Schlüssellänge:
pt_br: Novo tamanho de chave:
ru_ru: Длина нового ключа:
uk_ua: Довжина нового ключа:

source: Generate new key pair
de_de: Neues Schlüsselpaar erzeugen
pt_br: Gerar novo par de chaves
ru_ru: Создать новую пару ключей
uk_ua: Створити нову пару ключей

source: Public or private keys have not been generated correctly.
de_de: Der öffentliche oder der private Schlüssel konnten nicht fehlerfrei erzeugt werden.
pt_br: Chave pública ou privada não foi gerada corretamente.
ru_ru: Публичный или приватный ключ не был создан правильно.
uk_ua: Публічний або приватний ключ не було створено правильно.

source: plugin settings
de_de: Plugin-Einstellungen
pt_br: configuração do plugin
ru_ru: настройки плагина
uk_ua: налаштування плагіна

source: Maybe you want to change some %s.
de_de: Vielleicht möchten Sie die %s anpassen.
pt_br: Talvez você deseje mudar a %s.
ru_ru: Возможно, вы хотите изменить некоторые %s.
uk_ua: Можливо, ви бажаєте змінити деякі %s.

source: Public and private keys have been generated successfully, %s.
de_de: Öffentlicher und privater Schlüssel wurden erfolgreich erzeugt, %s.
pt_br: Chaves pública e privada foram geradas com sucesso, %s.
ru_ru: Публичный и приватный ключ созданы успешно, %s.
uk_ua: Публічний і приватний ключі було створено успішно, %s.
